Repository: ahmedomar11345/GymManagmentSystem0
Catalog: GymManagmentPL/Resources/SharedResource.*.resx
Languages: ar

# NoProgressRecords
source: No progress records found. Add your first measurement!
ar: لا يوجد سجل قياسات حالياً. أضف أول قياس لك!

source: Progression
ar: التطور

source: Current Weight
ar: الوزن الحالي

source: Last Check
ar: آخر فحص

# BMIUpdateInfo
source: BMI is automatically calculated based on the recorded height.
ar: يتم حساب BMI تلقائياً بناءً على الطول المسجل.

source: Fat
ar: الدهون

source: Save Measurement
ar: حفظ القياس
