Repository: ahmedomar11345/GymManagmentSystem0
Catalog: GymManagmentPL/Resources/SharedResource.*.resx
Languages: ar

# FreezeInfoText
source: The expiration date will be extended by this number of days.
ar: سيتم تمديد تاريخ انتهاء الصلاحية بهذا العدد من الأيام.

source: Confirm Freeze
ar: تأكيد التجميد

# GlobalSearch
source: Search for members, plans, trainers...
ar: ابحث عن الأعضاء، الخطط، والمدربين...

source: Total Revenue
ar: إجمالي الإيرادات

source: Monthly Revenue
ar: الإيرادات الشهرية

source: Revenue Analytics
ar: تحليلات الإيرادات

source: Member Growth
ar: نمو الأعضاء

source: Revenue for
ar: إيرادات شهر

source: Last 6 Months
ar: آخر 6 أشهر

source: Select Range
ar: اختر الفترة

source: vs last month
ar: مقارنة بالشهر الماضي

source: Last Year
ar: آخر سنة

source: Custom Range
ar: فترة مخصصة

# NoCheckIns
source: No check-ins for this day
ar: لا توجد تسجيلات دخول لهذا اليوم

# StatusSingle
source: Status
ar: الحالة

# MemberSingle
source: Member
ar: العضو

source: System
ar: النظام

source: Scheduled Tasks
ar: المهام المجدولة

# ScheduledTasksDesc
source: Manage and trigger automated system tasks
ar: إدارة وتشغيل المهام التلقائية للنظام

source: Print Receipt
ar: طباعة الإيصال

source: Membership Expiry Reminders
ar: تذكير انتهاء الاشتراكات

# ExpiryRemindersDesc
source: Send notifications to members whose subscriptions are ending soon.
ar: إرسال تذكير للأعضاء الذين ستنتهي اشتراكاتهم قريباً.

source: Before
ar: قبل

source: Day
ar: يوم

source: Run
ar: تشغيل

# SessionReminders
source: Upcoming Session Reminders
ar: تذكير بالجلسات القادمة

# SessionRemindersDesc
source: Remind members about their booked sessions.
ar: إرسال تذكير للأعضاء بجلساتهم المحجوزة.

source: Hour
ar: ساعة

source: Birthday Wishes
ar: تهنئة ذكرى الميلاد

# BirthdayWishesDesc
source: Send automated birthday greetings with a special discount.
ar: إرسال تهنئة تلقائية للأعضاء مع تقديم خصم خاص.

source: Inactive Members Alert
ar: تنبيه الأعضاء غير النشطين

# InactiveMembersAlertDesc
source: Identify members who haven't visited the gym recently.
ar: رصد الأعضاء الذين لم يحضروا للجيم منذ فترة.

source: Inactivity
ar: غياب

# QRCodeRefresh
source: QR Access Key Refresh (Security)
ar: تحديث أكواد الدخول (Security)

source: Security
ar: الأمان

# QRCodeRefreshDesc
source: Regenerate all member access keys and send new QR codes.
ar: تغيير جميع أكواد الـ QR للأعضاء النشطين وإرسالها بالإيميل.

source: Refresh All Now
ar: تحديث الكل الآن

# ConfirmQRCodeRefresh
source: This will regenerate all QR codes and email them to active members. Continue?
ar: هذا الإجراء سيقوم بتغيير جميع أكواد الدخول لكل الأعضاء وإرسالها عبر البريد الإلكتروني. هل أنت متأكد؟

source: Run All Tasks
ar: تشغيل جميع المهام

# RunAllTasksDesc
source: Execute all scheduled maintenance tasks at once.
ar: تنيذ كل مهام الصيانة المجدولة دفعة واحدة.

source: Run All
ar: تشغيل الكل

# ScheduledTasksNote
source: Note: These tasks can be triggered manually or automated using Windows Task Scheduler or Hangfire.
ar: ملاحظة: هذه المهام يمكن تشغيلها يدوياً من هنا، أو يمكن إعدادها للتشغيل التلقائي باستخدام Windows Task Scheduler أو Hangfire.

# DiscountPercentage
source: Discount
ar: نسبة الخصم

# ExpiryRemindersSent
source: Successfully sent {0} membership expiry reminders!
ar: تم إرسال {0} تذكير بانتهاء الاشتراك بنجاح!

# SessionRemindersSent
source: Successfully sent {0} session reminders!
ar: تم إرسال {0} تذكير بالجلسات القادمة بنجاح!

# BirthdayWishesSent
source: Successfully sent {0} birthday wishes!
ar: تم إرسال {0} تهنئة عيد ميلاد بنجاح!

# InactiveMembersAlertSent
source: Identified {0} inactive members and alerted admin!
ar: تم رصد {0} عضو غير نشط وتنبيه الإدارة!

# QRCodeRefreshSuccess
source: Successfully refreshed {0} access keys!
ar: تم تحديث {0} كود دخول QR بنجاح!

# AllTasksExecuted
source: All scheduled tasks executed successfully!
ar: تم تنفيذ جميع المهام المجدولة بنجاح!

source: All Notifications
ar: جميع الإشعارات

source: No notifications yet
ar: لا توجد إشعارات بعد

# NoNotificationsDesc
source: System alerts and reminders will appear here once they arrive.
ar: ستظهر تنبيهات النظام والتذكيرات هنا بمجرد وصولها.

source: Back to Dashboard
ar: العودة للوحة التحكم

# MarkAsRead
source: Clear
ar: حذف

source: View All Notifications
ar: عرض جميع الإشعارات

source: Update Settings
ar: تحديث الإعدادات

source: Not specified
ar: غير محدد

source: Account Type
ar: نوع الحساب

# MarkAllRead
source: Clear All
ar: مسح الكل

source: Account Settings
ar: إعدادات الحساب

source: Change Password
ar: تغيير كلمة المرور

source: Change Email
ar: تغيير البريد الإلكتروني

source: Update Security Password
ar: تحديث كلمة مرور الأمان

source: Current Password
ar: كلمة المرور الحالية

source: Enter current password
ar: أدخل كلمة المرور الحالية

source: New Password
ar: كلمة المرور الجديدة

source: Enter new password
ar: أدخل كلمة المرور الجديدة

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

source: Update Password
ar: تحديث كلمة المرور

source: Update Email Identity
ar: تحديث الهوية الإلكترونية

# EmailChangeAuditNote
source: Changing your email requires OTP verification for security.
ar: تغيير بريدك الإلكتروني يتطلب التحقق عبر رمز (OTP) لدواعي الأمان.

source: New Email Address
ar: عنوان البريد الإلكتروني الجديد

# EnterNewEmail
source: Enter new email address
ar: أدخل عنوان البريد الإلكتروني الجديد

source: Send Verification Code
ar: إرسال رمز التحقق

source: Select Language
ar: اختر اللغة

source: User
ar: مستخدم

# ChangeTheme
source: Toggle Theme
ar: تغيير المظهر

# EmailUpdatedSuccess
source: Email updated successfully!
ar: تم تحديث البريد الإلكتروني بنجاح!

# InvalidOTP
source: Invalid, expired, or mismatching OTP code.
ar: رمز التحقق غير صالح، منتهي الصلاحية، أو غير متطابق.

# InvalidLogin
source: Invalid email or password
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة.

# AccountLockedOut
source: Your account is locked out. Please try again later.
ar: الحساب مغلق حالياً. يرجى المحاولة لاحقاً.

# SignInNotAllowed
source: Sign-in is currently not allowed for this account.
ar: تسجيل الدخول غير مسموح به لهذا الحساب حالياً.

source: Invalid sign-in attempt.
ar: محاولة تسجيل دخول غير صالحة.

source: Verify Email OTP
ar: التحقق من البريد الإلكتروني

source: Verify Your Email
ar: تحقق من بريدك الإلكتروني

# VerificationCodeSentTo
source: We've sent a 6-digit verification code to
ar: لقد أرسلنا رمز تحقق مكون من 6 أرقام إلى

source: Verify Code
ar: تحقق من الرمز

# DidNotReceiveCode
source: Didn't receive the code?
ar: لم تصلك الرسالة؟

source: Try another email
ar: جرب بريداً آخر

# EmailVerificationSubject
source: Email Verification Code
ar: رمز التحقق لتغيير البريد الإلكتروني

# EmailVerificationBody
source: Your verification code to change email is: {0}. This code is valid for 10 minutes only.
ar: كود التحقق الخاص بك لتغيير البريد الإلكتروني هو: {0}. هذا الرمز صالح لمدة 10 دقائق فقط.

# EmailSendError
source: Failed to send verification email. Please check SMTP settings.
ar: فشل إرسال بريد التحقق. يرجى التحقق من إعدادات SMTP.

source: Financial Reports
ar: التقارير المالية

source: Financial Analytics
ar: التحليلات المالية

# FinancialAnalyticsDesc
source: Advanced revenue and profitability insights for
ar: رؤى متقدمة حول الإيرادات والربحية لـ

source: Year
ar: السنة

source: Estimated Expenses
ar: المصروفات التقديرية

# EstimatedExpensesDesc
source: Operating & Maintenance
ar: التشغيل والصيانة

# NetProfitDesc
source: Final earnings
ar: الأرباح النهائية

# RevenueTrend
source: Revenue Trend By Month
ar: اتجاه الإيرادات حسب الشهر

source: Membership Status
ar: حالة العضوية

source: Top Performing Plans
ar: الخطط الأكثر أداء

source: Monthly Breakdown Detail
ar: تفاصيل التقرير الشهري

source: Subscribers
ar: المشتركين

source: Revenue
ar: الإيرادات

source: Month
ar: الشهر

source: Subs
ar: المشتركين

source: Revenue (EGP)
ar: الإيرادات (ج.م)

source: Net Profit
ar: صافي الربح

source: Expenses
ar: المصروفات

# ExpenseTitle
source: Title
ar: العنوان

# ExpenseAmount
source: Amount
ar: المبلغ

# ExpenseDate
source: Date
ar: التاريخ

# ExpenseCategory
source: Category
ar: الفئة

# ExpenseNotes
source: Notes
ar: ملاحظات

source: Manage Expenses
ar: إدارة المصروفات

source: Add Expense
ar: إضافة مصروف

# NoExpensesFound
source: No expenses recorded yet.
ar: لا توجد مصروفات مسجلة بعد.

# DeleteExpenseConfirm
source: Are you sure you want to delete this expense?
ar: هل أنت متأكد من حذف هذا المصروف؟

# ExpensesDesc
source: Track and manage your gym's operational costs.
ar: تتبع وإدارة التكاليف التشغيلية للصالة الرياضية.

# Cat_Rent
source: Rent
ar: إيجار

# Cat_Utilities
source: Utilities (Electricity, Water, Internet)
ar: مرافق (كهرباء، مياه، إنترنت)

# Cat_Salaries
source: Salaries
ar: رواتب

# Cat_Maintenance
source: Maintenance
ar: صيانة

# Cat_Equipment
source: Equipment
ar: معدات

# Cat_Marketing
source: Marketing
ar: تسويق

# Cat_Other
source: Other
ar: أخرى

source: Are you sure?
ar: هل أنت متأكد؟

# YesDelete
source: Yes, delete it!
ar: نعم، احذفه!

source: Select Date Range
ar: اختر نطاق التاريخ

source: Apply
ar: تطبيق

# FeatureUnderDevelopment
source: This feature is under development.
ar: هذه الميزة قيد التطوير.

source: Manage Gym Identity and System Preferences
ar: إدارة هوية النادي وتفضيلات النظام

source: Gym Identity
ar: هوية النادي

source: Gym Name
ar: اسم الجيم

source: System Preferences
ar: تفضيلات النظام

source: Live Preview
ar: معاينة مباشرة

source: Need Help?
ar: هل تحتاج مساعدة؟

# SettingsHelpText
source: These settings will be reflected across all reports, receipts, and the website's header.
ar: هذه الإعدادات ستظهر في جميع التقارير، الوصلات، والهيدر الخاص بالموقع.

# SettingsTip1
source: Ensure the phone number is correct for member support.
ar: تأكد من صحة رقم الهاتف للتواصل.

# SettingsTip2
source: Gym name appears in the browser tab title.
ar: اسم الجيم يظهر في عنوان صفحات المتصفح.

source: Export PDF
ar: تصدير PDF

# CreateMembershipTitle
source: Create Membership
ar: إنشاء عضوية

# ActivateSubscriptionPlanDesc
source: Activate a new subscription plan for a member.
ar: تفعيل خطة اشتراك جديدة للعضو.

source: Back to Memberships
ar: العودة للعضويات

source: Select Member
ar: اختر العضو

source: -- Choose a member --
ar: -- اختر عضواً --

# SelectMemberInfo
source: Select the member who will subscribe to this plan.
ar: اختر العضو الذي سيشترك في هذه الخطة.

source: Select Plan
ar: اختر الخطة

source: -- Choose a subscription plan --
ar: -- اختر خطة اشتراك --

# ChooseFromActivePlans
source: Choose from available active plans.
ar: اختر من الخطط النشطة المتاحة.

source: Receipt Email Language
ar: لغة إرسال الإيصال

source: Arabic
ar: العربية

source: English
ar: الإنجليزية

# ReceiptLanguageDesc
source: Choose the language in which the member will receive their confirmation receipt.
ar: اختر اللغة التي سيتلقى بها العضو إيصال التأكيد.

# MembershipStartImmediately
source: The membership will start immediately upon creation.
ar: سيبدأ الاشتراك فوراً عند الإنشاء.

# EndDateCalculationInfo
source: End date will be calculated based on the plan duration.
ar: سيتم حساب تاريخ الانتهاء بناءً على مدة الخطة.

# ExpiryNotificationInfo
source: Member will be notified when the membership is about to expire.
ar: سيتم إخطار العضو عندما يقترب موعد انتهاء الاشتراك.

source: Important Information
ar: معلومات هامة

source: Create Membership
ar: إنشاء عضوية

# TrainerNamePlaceholder
source: Trainer Name
ar: اسم المدرب

source: Email Language
ar: لغة البريد الإلكتروني

# TrainerWelcomeEmailDesc
source: Choose the language for the trainer welcome email.
ar: اختر اللغة التي سيتم إرسال بريد الترحيب للمدرب بها.

source: General Fitness
ar: اللياقة العامة

source: Yoga
ar: يوغا

source: Boxing
ar: ملاكمة

source: CrossFit
ar: كروس فيت

source: Country
ar: البلد

# CountryRequired
source: Country is required.
ar: البلد مطلوب.

source: Egypt
ar: مصر

# ManageBookingsDesc
source: Manage and book training sessions for members.
ar: إدارة وحجز جلسات التدريب للأعضاء.

# UpcomingSessionsDesc
source: Sessions valid for managing bookings.
ar: الجلسات المتاحة لإدارة الحجز.

# OngoingSessionsDesc
source: Sessions valid for managing attendance.
ar: الجلسات المتاحة لإدارة الحضور.

# NoUpcomingSessions
source: No upcoming sessions available.
ar: لا توجد جلسات قادمة متاحة.

# NoOngoingSessions
source: No ongoing sessions available.
ar: لا توجد جلسات جارية متاحة.

source: View Members
ar: عرض الأعضاء

# TrainerColon
source: Trainer:
ar: المدرب:

# DateColon
source: Date:
ar: التاريخ:

# TimeColon
source: Time:
ar: الوقت:

# DurationColon
source: Duration:
ar: المدة:

# CapacityColon
source: Capacity:
ar: السعة:

source: slots
ar: أماكن

source: Audit Logs
ar: سجلات المراجعة

source: System Audit Logs
ar: سجلات مراجعة النظام

# TrackActions
source: Track administrative actions and data changes.
ar: تتبع الإجراءات الإدارية وتغييرات البيانات.

source: Timestamp
ar: الطابع الزمني

source: Action
ar: الإجراء

source: Entity
ar: الكيان

source: Entity ID
ar: معرف الكيان

source: Audit Log Details
ar: تفاصيل سجل المراجعة

source: Old Values
ar: القيم القديمة

source: New Values
ar: القيم الجديدة

source: No previous data
ar: لا توجد بيانات سابقة

source: No new data
ar: لا توجد بيانات جديدة

source: Registry
ar: السجل

source: Session Registry
ar: سجل الجلسة

source: Enroll Member
ar: تسجيل عضو

# EnrollMemberDesc
source: Only members with active subscriptions will appear in the selection below.
ar: فقط الأعضاء الذين لديهم اشتراكات نشطة سيظهرون في الاختيار أدناه.

source: Booking Policy
ar: سياسة الحجز

# BookingPolicyDesc
source: Members can only book if their plan is valid for the session date. If a member is missing, ensure they have an active plan.
ar: يمكن للأعضاء الحجز فقط إذا كانت خطتهم صالحة في تاريخ الجلسة. إذا كان العضو مفقوداً، تأكد من أن لديه خطة نشطة.

source: Confirm Enrollment
ar: تأكيد التسجيل

source: processing...
ar: جاري المعالجة...

source: Cancel and return
ar: إلغاء والعودة

# RegistryEmpty
source: Registry is empty
ar: السجل فارغ

# RegistryEmptyDesc
source: No members booked for this session yet.
ar: لم يقم أي أعضاء بالحجز لهذه الجلسة بعد.

source: Back to Sessions
ar: العودة للجلسات

source: Remove Member
ar: إزالة عضو

source: Member Name
ar: اسم العضو

source: Booking Date
ar: تاريخ الحجز

source: Excel
ar: إكسل

source: PDF
ar: بي دي إف

source: -- Select available member --
ar: -- اختر عضواً متاحاً --

# NoAvailableMembers
source: -- No available members with active plans --
ar: -- لا يوجد أعضاء متاحون بخطط نشطة --

source: Repeat For
ar: تكرار لـ

source: Times
ar: مرات

# RecurrenceNote
source: Use this to automatically schedule multiple sessions at once.
ar: استخدم هذا لجدولة جلسات متعددة تلقائياً في وقت واحد.

source: Discard Changes
ar: تجاهل التغييرات

source: Training Session
ar: جلسة تدريب

source: Booked Members
ar: الأعضاء المحجوزون

# RegistryTitle
source: Registry
ar: السجل

source: Minutes
ar: دقائق

source: Hours
ar: ساعات

source: Repeat Pattern
ar: نمط التكرار

source: Update Session Schedule
ar: تحديث جدول الجلسة

# SessionEditNotice
source: Category and basic structure cannot be changed once session is created and bookings might exist.
ar: لا يمكن تغيير الفئة والهيكل الأساسي بمجرد إنشاء الجلسة وقد توجد حجوزات.

# ScheduleEditWarning
source: Changing schedule might affect members who already booked this session.
ar: قد يؤثر تغيير الجدول على الأعضاء الذين حجزوا هذه الجلسة بالفعل.

source: Ongoing
ar: جارية

# DeleteSessionWarning
source: This action cannot be undone. All session data and bookings will be permanently deleted.
ar: لا يمكن التراجع عن هذا الإجراء. سيتم حذف جميع بيانات الجلسة والحجوزات بشكل دائم.

# ConfirmDeleteSession
source: Are you sure you want to delete this session?
ar: هل أنت متأكد أنك تريد حذف هذه الجلسة؟

source: Session Members
ar: أعضاء الجلسة

# SessionMembersDesc
source: List of members registered for this session.
ar: قائمة الأعضاء المسجلين في هذه الجلسة.

source: Attendance Status
ar: حالة الحضور

source: Attended
ar: حضر

# Absent
source: Not Yet / Absent
ar: ليس بعد / غائب

# NoMembersRegistered
source: No members registered yet
ar: لا يوجد أعضاء مسجلون بعد

# NoMembersRegisteredDesc
source: Once members book this session, they will appear here.
ar: بمجرد قيام الأعضاء بحجز هذه الجلسة، سيظهرون هنا.

source: Warning
ar: تحذير

source: Member Session
ar: جلسة العضو

source: Booking Management
ar: إدارة الحجوزات

source: Attendance Sheet
ar: كشف الحضور

source: Attendance Progress
ar: تقدم الحضور

source: Present
ar: حاضر

source: Pending
ar: قيد الانتظار

source: Mark Present
ar: تحديد كحاضر

source: Logged
ar: تم التسجيل

# NoMembersMatched
source: No members matched this session
ar: لا يوجد أعضاء مطابقون لهذه الجلسة

# NoMembersMatchedDesc
source: You cannot mark attendance if no members were booked before the session started.
ar: لا يمكنك تسجيل الحضور إذا لم يتم حجز أي أعضاء قبل بدء الجلسة.

source: Back to Bookings
ar: العودة للحجوزات

source: Back to Live List
ar: العودة للقائمة المباشرة

source: Active Member
ar: عضو نشط

source: Attendance History & Analysis
ar: سجل الحضور والتحليل

# EmailLanguageDesc
source: Choose the language for the QR access code email.
ar: اختر لغة البريد الإلكتروني الخاص برمز الاستجابة السريعة (QR).

source: No Plans Available
ar: لا توجد خطط متاحة

source: Access
ar: الدخول

# DeniedText
source: Denied
ar: مرفوض

# AccessDeniedDesc
source: We're sorry, but you don't have permission to access this resource. Your current user role or membership status doesn't grant you access to this section.
ar: عذرًا، ولكن ليس لديك إذن للوصول إلى هذا المصدر. لا يمنحك دور المستخدم الحالي أو حالة العضوية الوصول إلى هذا القسم.

source: Error Code
ar: رمز الخطأ

source: Forbidden Access
ar: وصول محظور

# AccessDeniedHelp
source: If you believe this is an error or need elevated permissions, please contact the system administrator or your membership manager for assistance.
ar: إذا كنت تعتقد أن هذا خطأ أو تحتاج إلى أذونات مرتفعة، يرجى الاتصال بمسؤول النظام أو مدير العضوية للحصول على المساعدة.

source: Return to Home
ar: العودة إلى الصفحة الرئيسية

source: Retention Rate
ar: معدل الاستبقاء

# AuditLogsDesc
source: Track administrative actions and data changes.
ar: تتبع الإجراءات الإدارية وتغييرات البيانات.

source: on
ar: على

source: No Data
ar: لا توجد بيانات

source: Expired
ar: منتهي الصلاحية

# NoAttendanceThisWeek
source: No attendance records found for this week.
ar: لا توجد سجلات حضور لهذا الأسبوع.

source: Audit Log
ar: سجل المراجعة

source: Visits per Month
ar: الزيارات شهرياً

# AuditLogAction_Create
source: Created
ar: إنشاء

# AuditLogAction_Update
source: Updated
ar: تحديث

# AuditLogAction_Delete
source: Deleted
ar: حذف

source: Daily
ar: يومياً

source: Weekly
ar: أسبوعياً

source: Monthly
ar: شهرياً

source: Attendance History
ar: سجل الحضور

# ReviewWeeklyAttendance
source: Review weekly attendance log
ar: مراجعة سجل الحضور الأسبوعي

source: Daily Attendance History
ar: سجل الحضور اليومي

source: Monthly Member Attendance
ar: حضور الأعضاء الشهري

source: Monthly Leaderboard
ar: لوحة الصدارة الشهرية

# TrackMemberConsistency
source: Track member consistency and participation
ar: تتبع التزام الأعضاء بالحضور

source: Export Report
ar: تصدير التقرير

source: Total Attendees
ar: إجمالي الحضور

# TopMember
source: Most Consistent Member
ar: العضو الأكثر حضوراً

source: Avg. Attendance
ar: متوسط الحضور

source: Attendance Ranking
ar: ترتيب الحضور

source: Search by member name
ar: البحث باسم العضو

# Ranking
source: Rank
ar: الترتيب

source: Days Visited
ar: أيام الحضور

source: Attendance Level
ar: مستوى الحضور

source: Last Seen
ar: آخر ظهور

source: Verified
ar: تم التحقق

source: Checked In
ar: سجل دخول

source: Total Visits Today
ar: إجمالي زيارات اليوم

source: Weekly Total
ar: إجمالي الأسبوع

source: Daily Average
ar: المتوسط اليومي

source: Check-ins
ar: عمليات الدخول

# ReviewWeeklyAttendanceAnalytics
source: Review detailed attendance analytics and logs
ar: مراجعة تحليلات وسجلات الحضور المفصلة

source: Daily Member Attendance
ar: حضور الأعضاء اليومي

source: Total Check-ins
ar: إجمالي عمليات الدخول

source: Busy Time
ar: وقت الذروة

# HighestEntryPeak
source: Highest entry peak recorded
ar: أعلى معدل دخول تم تسجيله

source: Average Duration
ar: متوسط المدة

# EstimatedAvgStay
source: Estimated average stay duration
ar: متوسط مدة البقاء المقدرة

source: No Check-ins Found
ar: لم يتم العثور على عمليات دخول

source: Attendance Logs
ar: سجلات الحضور

source: New Attendance
ar: تسجيل حضور جديد

source: Plan
ar: الباقة

source: Print
ar: طباعة

source: Visits
ar: الزيارات

source: Export
ar: تصدير

source: No records found
ar: لم يتم العثور على سجلات

source: Daily Attendance Report
ar: تقرير الحضور اليومي

# GymCurrentState
source: Current Gym State
ar: حالة الجيم الحالية

source: Member Logs
ar: سجلات الأعضاء

source: Search members
ar: البحث عن أعضاء

source: Trainer Logs
ar: سجلات المدربين

source: Search trainers
ar: البحث عن مدربين

# NoTrainerAttendance
source: No trainer attendance records for today
ar: لا يوجد سجلات حضور للمدربين اليوم

source: Daily Attendance
ar: الحضور اليومي

source: Trainer Monthly Report
ar: التقرير الشهري للمدربين

source: Trainer Monthly Leaderboard
ar: لوحة المدربين الشهرية

source: Trainer Attendance Ranking
ar: ترتيب حضور المدربين

source: Search by trainer name...
ar: بحث باسم المدرب...

source: Attendance Days
ar: أيام الحضور

source: Total Hours
ar: إجمالي الساعات

source: Total Delay
ar: إجمالي التأخير

source: Monthly Trainer Attendance
ar: حضور المدربين الشهري

# ReadyForScan
source: Ready to scan...
ar: في انتظار مسح الكود...

source: Ready for next member...
ar: في انتظار العضو التالي...

source: Manage Specialties
ar: إدارة التخصصات

source: Trainer Specialties
ar: تخصصات المدربين

# ManageSpecialtiesDesc
source: Manage different categories and classifications of trainers in the system.
ar: إدارة فئات وتصنيفات المدربين المختلفة في النظام.

source: Add New Specialty
ar: إضافة تخصص جديد

source: Edit Specialty
ar: تعديل التخصص

source: Specialty Name
ar: اسم التخصص

source: Trainers Count
ar: عدد المدربين

# SpecialtyCreated
source: Specialty added successfully!
ar: تم إضافة التخصص بنجاح!

# SpecialtyUpdated
source: Specialty updated successfully!
ar: تم تحديث التخصص بنجاح!

# SpecialtyDeleted
source: Specialty deleted successfully!
ar: تم حذف التخصص بنجاح!

# DeleteSpecialtyConfirm
source: Are you sure you want to delete this specialty? It will be unassigned from all linked trainers.
ar: هل أنت متأكد من حذف هذا التخصص؟ سيتم إلغاء تعيينه من جميع المدربين المرتبطين به.

source: Search specialties...
ar: بحث في التخصصات...

source: No specialties found.
ar: لم يتم العثور على تخصصات.

source: Add Specialty
ar: إضافة تخصص

# ExpiredMembershipNotificationsSent
source: Sent {0} expired membership notification(s) successfully.
ar: تم إرسال {0} إشعار(ات) انتهاء اشتراك بنجاح.

# ExpiringSoonMembers
source: Memberships Expiring Soon
ar: عضويات أوشكت على الانتهاء

# DaysRemainingLabel
source: {0} days left
ar: متبقي {0} أيام

# RecentActivities
source: Recent System Activities
ar: أحدث النشاطات في النظام

source: View All
ar: عرض الكل

# NoExpiringMembers
source: No memberships expiring soon.
ar: لا توجد عضويات توشك على الانتهاء حالياً.

# ExpiringToday
source: Expires today
ar: تنتهي اليوم ⚠️

source: Just now
ar: الآن

source: Quick Access
ar: وصول سريع

source: Scanner
ar: الماسح الضوئي

source: Send by Email
ar: إرسال عبر الإيميل

source: Expires On
ar: تاريخ الانتهاء

source: Thank you for choosing
ar: شكراً لاختياركم

source: Waitlisted
ar: قائمة الانتظار

source: Confirmed
ar: تم التأكيد

source: Waitlist
ar: الانتظار

source: FULL
ar: مكتمل العدد

source: Remove from Waitlist
ar: حذف من الانتظار

source: Health Progression
ar: متابعة التطور الصحي

source: Track Progress
ar: متابعة التطور

source: Add Measurement
ar: إضافة قياس جديد

source: Weight Trend
ar: تطور الوزن

source: BMI Trend
ar: تطور BMI

source: Progress History
ar: سجل القياسات

source: Body Fat (%)
ar: نسبة الدهون (%)

# MuscleMass
source: Muscle Mass (kg)
ar: كتلة العضلات (كجم)
