Repository: ahmedomar11345/GymManagmentSystem0
Catalog: GymManagmentPL/Resources/SharedResource.*.resx
Languages: ar

# AppName
source: Gym Management
ar: نظام إدارة الجيم

source: Dashboard
ar: لوحة التحكم

source: Members
ar: الأعضاء

source: Trainers
ar: المدربين

source: Sessions
ar: الجلسات

source: Bookings
ar: الحجوزات

source: Memberships
ar: العضويات

source: Plans
ar: الخطط

source: Logout
ar: تسجيل الخروج

source: Login
ar: تسجيل الدخول

source: Trainer
ar: مدرب

source: Session
ar: جلسة

source: Expense
ar: مصروف

# Plane
source: Plan
ar: خطة

source: Create
ar: إنشاء

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: Search
ar: بحث

source: Details
ar: التفاصيل

source: Back
ar: رجوع

source: Confirm
ar: تأكيد

source: Update
ar: تحديث

# CreateSuccess
source: Created successfully!
ar: تم الإنشاء بنجاح!

# UpdateSuccess
source: Updated successfully!
ar: تم التحديث بنجاح!

# DeleteSuccess
source: Deleted successfully!
ar: تم الحذف بنجاح!

# CancelSuccess
source: Cancelled successfully!
ar: تم الإلغاء بنجاح!

# OperationFailed
source: Operation failed. Please try again.
ar: فشلت العملية. يرجى المحاولة مرة أخرى.

# NotFound
source: Record not found.
ar: السجل غير موجود.

# InvalidInput
source: Invalid input. Please check your data.
ar: إدخال غير صالح. يرجى التحقق من البيانات.

# Required
source: This field is required.
ar: هذا الحقل مطلوب.

# InvalidEmail
source: Invalid email address.
ar: عنوان بريد إلكتروني غير صالح.

# InvalidPhone
source: Invalid phone number.
ar: رقم هاتف غير صالح.

# PhotoRequired
source: Please select a member photo.
ar: برجاء اختيار صورة العضو.

# NameRequired
source: Member name is required.
ar: اسم العضو مطلوب.

# NameLength
source: Name must be between {2} and {1} characters.
ar: يجب أن يكون الاسم بين {2} و {1} حرفاً.

# EmailLength
source: Email must be between {2} and {1} characters.
ar: يجب أن يكون البريد الإلكتروني بين {2} و {1} حرفاً.

# EmailRequired
source: Email is required.
ar: البريد الإلكتروني مطلوب.

# PhoneRequired
source: Phone number is required.
ar: رقم الهاتف مطلوب.

# EgyptianPhone
source: Phone must be a valid Egyptian mobile number (01XXXXXXXXX).
ar: يجب أن يكون رقم الهاتف مصرياً صالحاً (01XXXXXXXXX).

# DateOfBirthRequired
source: Date of birth is required.
ar: تاريخ الميلاد مطلوب.

# GenderRequired
source: Please select a gender.
ar: يرجى تحديد الجنس.

# AddressRequired
source: Address is required.
ar: العنوان مطلوب.

# CityRequired
source: Please enter a city name.
ar: يرجى إدخال اسم المدينة.

# CityLength
source: City name must be between {2} and {1} characters.
ar: اسم المدينة يجب أن يكون بين {2} و {1} حرفاً.

# StreetRequired
source: Please enter a street name.
ar: يرجى إدخال اسم الشارع.

# StreetLength
source: Street name must be between {2} and {1} characters.
ar: اسم الشارع يجب أن يكون بين {2} و {1} حرفاً.

# BuildingNumberRequired
source: Building number is required.
ar: رقم المبنى مطلوب.

# BuildingNumberRange
source: Building number must be between {1} and {2}.
ar: رقم المبنى يجب أن يكون بين {1} و {2}.

# PlanNameRequired
source: Plan name is required.
ar: اسم الخطة مطلوب.

# PlanNameLength
source: Plan name cannot exceed {0} characters.
ar: يجب ألا يتجاوز اسم الخطة {1} حرفاً.

# PriceRequired
source: Price is required.
ar: سعر الخطة مطلوب.

# PriceRange
source: Price must be between {1} and {2}.
ar: يجب أن يكون السعر بين {1} و {2} جنيه.

# DurationRequired
source: Duration is required.
ar: مدة الخطة مطلوبة.

# DurationRange
source: Duration must be between {1} and {2} days.
ar: يجب أن تكون المدة بين {1} و {2} يوم.

# DescriptionRequired
source: Description is required.
ar: وصف العملية مطلوب.

# DescriptionLength
source: Description cannot exceed {0} characters.
ar: يجب ألا يتجاوز الوصف {1} حرفاً.

# SpecialtyRequired
source: Please select a specialty.
ar: يرجى تحديد التخصص.

# CapacityRequired
source: Capacity is required.
ar: سعة الجلسة مطلوبة.

# CapacityRange
source: Capacity must be between {1} and {2}.
ar: يجب أن تكون السعة بين {1} و {2} أشخاص.

# StartDateRequired
source: Start date is required.
ar: تاريخ البدء مطلوب.

# EndDateRequired
source: End date is required.
ar: تاريخ الانتهاء مطلوب.

# TrainerRequired
source: Please select a trainer.
ar: يرجى اختيار المدرب.

# CategoryRequired
source: Please select a category.
ar: يرجى اختيار القسم.

# RecurrenceCountRange
source: Recurrence count must be between {1} and {2}.
ar: يجب أن يكون عدد التكرار بين {1} و {2}.

# ExpenseTitleRequired
source: Expense title is required.
ar: عنوان المصروف مطلوب.

# AmountRequired
source: Amount is required.
ar: المبلغ مطلوب.

# AmountRange
source: Amount must be greater than {1}.
ar: يجب أن يكون المبلغ أكبر من {1}.

# ExpenseDateRequired
source: Expense date is required.
ar: تاريخ المصروف مطلوب.

# HeightRequired
source: Height is required.
ar: الطول مطلوب.

# HeightRange
source: Height must be between {1} and {2} cm.
ar: يجب أن يكون الطول بين {1} و {2} سم.

# WeightRequired
source: Weight is required.
ar: الوزن مطلوب.

# WeightRange
source: Weight must be between {1} and {2} kg.
ar: يجب أن يكون الوزن بين {1} و {2} كجم.

# BloodTypeRequired
source: Blood type is required.
ar: فصيلة الدم مطلوبة.

# BloodTypeLength
source: Blood type cannot exceed {0} characters.
ar: يجب ألا تتجاوز فصيلة الدم {1} أحرف.

# MemberRequired
source: Please select a member.
ar: يرجى اختيار العضو.

# PlanRequired
source: Please select a membership plan.
ar: يرجى اختيار خطة الاشتراك.

# PasswordRequired
source: Password is required.
ar: كلمة المرور مطلوبة.

# FirstNameRequired
source: First name is required.
ar: الاسم الأول مطلوب.

# LastNameRequired
source: Last name is required.
ar: الاسم الأخير مطلوب.

# CurrentPasswordRequired
source: Current password is required.
ar: كلمة المرور الحالية مطلوبة.

# NewPasswordRequired
source: New password is required.
ar: كلمة المرور الجديدة مطلوبة.

# PasswordLength
source: Password must be between {2} and {1} characters.
ar: يجب أن تكون كلمة المرور بين {2} و {1} حرفاً.

# PasswordMismatch
source: Password and confirmation do not match.
ar: كلمة المرور وتأكيدها غير متطابقين.

# HealthRecordRequired
source: Health record data is required.
ar: بيانات السجل الصحي مطلوبة.

# FullNamePlaceholder
source: Enter full name
ar: أدخل الاسم بالكامل للعميل

# EmailPlaceholder
source: member@example.com
ar: email@example.com

# CityPlaceholder
source: Cairo
ar: القاهرة

# StreetPlaceholder
source: Street Name
ar: اسم الشارع

# MedicalNotesPlaceholder
source: Injuries, medical conditions, etc.
ar: مثل: إصابات، حالات طبية خاصة، إلخ.

# DeleteConfirmTitle
source: Confirm Delete
ar: تأكيد الحذف

# DeleteConfirmMessage
source: Are you sure you want to delete this record? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف هذا السجل؟ لا يمكن التراجع عن هذا الإجراء.

# CancelConfirmTitle
source: Confirm Cancellation
ar: تأكيد الإلغاء

# CancelConfirmMessage
source: Are you sure you want to cancel?
ar: هل أنت متأكد أنك تريد الإلغاء؟

source: Active Members
ar: الأعضاء النشطين

source: Total
ar: الإجمالي

source: Members Analysis
ar: تحليل الأعضاء

source: Main Menu
ar: القائمة الرئيسية

source: Administration
ar: الإدارة

source: Operations
ar: العمليات

source: Welcome
ar: مرحباً

source: Management System
ar: نظام الإدارة

source: Manage Bookings
ar: إدارة الحجوزات

source: Register Member
ar: تسجيل عضو

source: Upcoming Sessions
ar: الجلسات القادمة

source: Total Trainers
ar: إجمالي المدربين

# ProfessionalStaff
source: Professional Coaching Staff
ar: طاقم التدريب الاحترافي

# ScheduledTraining
source: Scheduled Training Today
ar: التدريبات المجدولة اليوم

# GymHealthy
source: Your gym is looking healthy today.
ar: ناديكم يبدو بحالة جيدة اليوم.

source: Good Morning
ar: صباح الخير

source: Good Afternoon
ar: مساء الخير

source: Good Evening
ar: مساء الخير

source: Entrance Check-in
ar: تسجيل الدخول بوابة

source: QR Scanner
ar: ماسح الكود

source: Settings
ar: الإعدادات

source: Profile
ar: الملف الشخصي

# LoginTitle
source: Admin Login
ar: دخول المدير

# LoginSubtitle
source: Welcome back! Please login to your account
ar: أهلاً بك مجدداً! يرجى تسجيل الدخول إلى حسابك

source: Email Address
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

# RememberMe
source: Remember me for 24 hours
ar: تذكرني لمدة 24 ساعة

# LoginButton
source: Login to Dashboard
ar: تسجيل الدخول

# FeatureHeroText
source: Your body can stand almost anything
ar: جسدك يمكنه تحمل أي شيء تقريبًا

# FeatureDescription
source: It's your mind that needs convincing. Push past your limits, stay committed, and watch as your body transforms.
ar: عقلك هو الذي يحتاج إلى الاقتناع. تجاوز حدودك، وحاظ على التزامك، وشاهد جسدك يتحول.

source: Support
ar: الدعم الفني

# ManageProfiles
source: Manage profiles and records.
ar: إدارة ملفات الأعضاء والسجلات.

source: Contact Info
ar: معلومات الاتصال

source: Gender
ar: النوع

source: Date of Birth
ar: تاريخ الميلاد

source: No members found
ar: لم يتم العثور على أعضاء

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Name
ar: الاسم

source: Email
ar: البريد الإلكتروني

source: Phone
ar: رقم الهاتف

source: Member
ar: العضو

source: Actions
ar: الإجراءات

source: Add New Member
ar: إضافة عضو جديد

source: Basic Information
ar: المعلومات الأساسية

source: Profile Photo
ar: صورة الملف الشخصي

source: Upload Image
ar: تحميل صورة

source: Full Name
ar: الاسم بالكامل

source: Address
ar: العنوان

source: Health Record
ar: السجل الصحي

source: Blood Type
ar: فصيلة الدم

source: Weight
ar: الوزن

source: Height
ar: الطول

source: Chronic Diseases
ar: الأمراض المزمنة

source: Physical Activity
ar: النشاط البدني

source: Membership Plan
ar: خطة العضوية

source: (Optional)
ar: (اختياري)

source: Requirements
ar: المتطلبات

source: Max size
ar: أقصى حجم

source: Format
ar: الصيغة

# RegisterMemberTitle
source: Register Member
ar: تسجيل العضو

source: Enter full name
ar: أدخل الاسم بالكامل

source: City
ar: المدينة

source: Street
ar: الشارع

source: Address Details
ar: تفاصيل العنوان

# BuildingNumber
source: Building No.
ar: رقم المبنى

# HealthStatus
source: Initial Health Status
ar: الحالة الصحية الأولية

source: Weight (kg)
ar: الوزن (كجم)

source: Height (cm)
ar: الطول (سم)

source: Select
ar: اختر

source: Medical Notes
ar: ملاحظات طبية

# NoActiveMembership
source: -- No Active Membership For Now --
ar: -- لا يوجد اشتراك حالياً --

# SkipAssignLater
source: You can skip this and assign a plan later from the member's profile.
ar: يمكنك تخطي هذه الخطوة وتعيين باقة لاحقاً من الملف الشخصي للعضو.

source: Ready to register?
ar: هل أنت جاهز للتسجيل؟

# MemberAddedImmediately
source: Member will be added to the database immediately.
ar: سيتم إضافة العضو إلى قاعدة البيانات فوراً.

# RegisterAndActivate
source: Register Member & Activate Plan
ar: تسجيل العضو وتفعيل الباقة

# DaysText
source: Days
ar: يوم

source: Member Details
ar: تفاصيل العضو

source: Member Profile
ar: ملف العضو

source: Edit Profile
ar: تعديل الملف

source: Back to List
ar: العودة للقائمة

source: No Active Plan
ar: لا توجد باقة مفعلة

source: Member Since
ar: عضو منفذ

source: Digital Member ID
ar: هوية العضو الرقمية

source: Personal Information
ar: المعلومات الشخصية

source: Join Date
ar: تاريخ الانضمام

source: Sessions Booked
ar: الجلسات المحجوزة

source: Membership Details
ar: تفاصيل العضوية

source: Current Plan
ar: الباقة الحالية

source: Start Date
ar: تاريخ البدء

source: End Date
ar: تاريخ الانتهاء

source: None
ar: لاشيء

source: N/A
ar: غير متوفر

source: No address provided
ar: لم يتم توفير عنوان

source: BMI
ar: مؤشر كتلة الجسم

source: cm
ar: سم

source: kg
ar: كجم

source: -- No Active Membership For Now --
ar: -- لا توجد عضوية نشطة حالياً --

source: Edit Member Profile
ar: تعديل ملف العضو

source: Save Changes
ar: حفظ التغييرات

source: Member ID
ar: معرف العضو

source: Contact Address
ar: عنوان الاتصال

source: Ready to save?
ar: جاهز للحفظ؟

# ReviewChanges
source: Please review all changes before confirming.
ar: يرجى مراجعة التغييرات قبل التأكيد.

source: Update Profile
ar: تحديث الملف الشخصي

source: Trainers Management
ar: إدارة المدربين

# TrainersDesc
source: Manage professional training staff and specialties.
ar: إدارة طاقم التدريب المحترفين والتخصصات.

source: Add New Trainer
ar: إضافة مدرب جديد

source: Specialty
ar: التخصص

source: No trainers found
ar: لم يتم العثور على مدربين

# NoTrainersDesc
source: Try adjusting your search or add a new trainer to the staff.
ar: حاول ضبط البحث أو إضافة مدرب جديد إلى الطاقم.

source: Specialties
ar: التخصصات

source: Add Trainer
ar: إضافة مدرب

source: Add New
ar: إضافة جديد

source: Primary Specialty
ar: التخصص الرئيسي

source: Professional
ar: احترافي

source: -- Select Specialist --
ar: -- اختر متخصص --

source: Register Trainer
ar: تسجيل المدرب

source: Trainer Profile
ar: ملف المدرب

source: Specialist
ar: متخصص

source: Staff Member
ar: موظف

source: Office Address
ar: عنوان المكتب

source: Staff Details
ar: تفاصيل الموظف

source: Send message
ar: إرسال رسالة

source: Registered On
ar: تم التسجيل في

# TrainerAccessNote
source: Staff profiles are managed by administrative users only. Regular members cannot view full contact details.
ar: تتم إدارة ملفات الموظفين بواسطة المستخدمين الإداريين فقط. لا يمكن للأعضاء العاديين عرض تفاصيل الاتصال الكاملة.

# EditTrainerInfo
source: Edit Trainer Information
ar: تعديل معلومات المدرب

source: -- Select Gender --
ar: -- اختر الجنس --

source: Address Information
ar: معلومات العنوان

source: Professional Information
ar: المعلومات المهنية

# DeleteTrainerConfirmation
source: Are you sure you want to delete this Trainer?
ar: هل أنت متأكد أنك تريد حذف هذا المدرب؟

# DeleteWarning
source: Warning!
ar: تحذير!

# DeleteTrainerDesc
source: This action cannot be undone. All Trainer data will be permanently deleted.
ar: لا يمكن التراجع عن هذا الإجراء. سيتم حذف جميع بيانات المدرب بشكل دائم.

source: No
ar: لا

source: Yes
ar: نعم

source: Membership Plans
ar: خطط العضوية

# PlansDesc
source: Manage subscription packages and pricing.
ar: إدارة حزم الاشتراك والأسعار.

source: Create New Plan
ar: إنشاء خطة جديدة

source: Active
ar: نشط

source: Inactive
ar: غير نشط

# EGPPerPackage
source: EGP / Package
ar: ج.م / الباقة

source: Duration
ar: المدة

# DurationDaysText
source: Days
ar: أيام

# DescriptionLabel
source: Description:
ar: الوصف:

source: Deactivate
ar: إلغاء التنشيط

source: Activate
ar: تنشيط

# NoPlansFound
source: No membership plans found
ar: لم يتم العثور على خطط عضويته

# NoPlansDesc
source: Get started by creating your first subscription package.
ar: ابدأ بإنشاء أول حزمة اشتراك لك.

source: Plan Name
ar: اسم الخطة

source: EGP
ar: ج.م

source: Design New Package
ar: تصميم حزمة جديدة

source: New Policy
ar: سياسة جديدة

source: Design Package
ar: تصميم الحزمة

source: Package Name
ar: اسم الحزمة

source: Package Price
ar: سعر الحزمة

source: Duration Policy
ar: سياسة المدة

source: Plan Benefits & Rules
ar: مزايا وقواعد الخطة

# PlanDescriptionPlaceholder
source: Describe what members get with this package...
ar: ص ما يحصل عليه الأعضاء مع هذه الحزمة...

# PlanDescriptionTip
source: Use clear, bullet-point style descriptions for better member readability.
ar: استخدم أسلوب النقاط الواضحة لوصف المزايا لسهولة القراءة.

# NewPlanActivationNote
source: New plans are created as Active by default. You can deactivate them anytime from the dashboard.
ar: يتم إنشاء الخطط الجديدة كنشطة افتراضياً. يمكنك إلغاء تنشيطها في أي وقت من لوحة التحكم.

source: Discard
ar: تجاهل

source: Create Package
ar: إنشاء حزمة

source: Plan Details
ar: تفاصيل الخطة

source: Current Status
ar: الحالة الحالية

source: Available for new members
ar: متاح للأعضاء الجدد

source: Registration Closed
ar: التسجيل مغلق

source: Edit Plan Details
ar: تعديل تفاصيل الخطة

source: Deactivate Plan
ar: إلغاء تنشيط الخطة

source: Activate Plan
ar: تنشيط الخطة

source: Back to All Plans
ar: العودة إلى جميع الخطط

source: Update Membership Package
ar: تحديث حزمة العضوية

source: Update Package
ar: تحديث الحزمة

source: Edit Package
ar: تعديل الحزمة

# PlanNameTrackingNote
source: Plan name cannot be changed for tracking consistency.
ar: لا يمكن تغيير اسم الخطة لضمان اتساق التتبع.

source: Updated Price
ar: السعر المحدث

source: New Duration Policy
ar: سياسية المدة الجديدة

source: Updated Plan Benefits
ar: مزايا الخطة المحدثة

# UpdatePlanDescriptionPlaceholder
source: Update the plan description...
ar: تحديث وصف الخطة...

source: Policy Update:
ar: تحديث السياسة:

# PolicyUpdateDesc
source: Changes will apply to all future subscriptions. Existing active memberships will retain their original price and duration until they expire.
ar: ستنطبق التغييرات على جميع الاشتراكات المستقبلية. ستحتظ الاشتراكات النشطة الحالية بسعرها ومدتها الأصلية حتى تنتهي صلاحيتها.

source: QR Check-in Scanner
ar: ماسح التحقق من QR

source: Gym Entrance
ar: مدخل الصالة الرياضية

# ScannerInstructions
source: Point the camera at the member's Digital ID QR code.
ar: وجه الكاميرا نحو رمز QR الخاص بالهوية الرقمية للعضو.

source: Next Scan
ar: المسح التالي

source: Recent Activity
ar: النشاط الأخير

source: Loading history...
ar: جاري تحميل السجل...

source: Access Granted
ar: تم السماح بالدخول

source: Access Denied
ar: تم رفض الدخول

# SystemError
source: System error occurred.
ar: حدث خطأ في النظام.

source: Time
ar: الوقت

source: Status
ar: الحالة

source: View Details
ar: عرض التفاصيل

source: Delete Member
ar: حذف العضو

source: Live Now
ar: مباشر الآن

source: Active Sessions in Progress
ar: جلسات نشطة جارية

source: Management Modules
ar: وحدات الإدارة

source: Staff
ar: طاقم العمل

source: Pricing
ar: التسعير

source: Attendance
ar: الحضور

source: System Snapshot
ar: لمحة عن النظام

source: Completed
ar: مكتمل

source: Database
ar: قاعدة البيانات

source: Healthy
ar: سليمة

source: Storage
ar: التخزين

source: Connected
ar: متصل

# FlexGymManagementTitle
source: Gym Management
ar: نظام إدارة الجيم

source: System Online
ar: النظام متصل

# SearchPlaceholder
source: Type to search anything (members, trainers, sessions)...
ar: اكتب للبحث عن أي شيء (أعضاء، مدربين، جلسات)...

source: Notifications
ar: الإشعارات

# NotificationsEmpty
source: You're all caught up!
ar: أنت مطلع على كل شيء!

source: Administrator
ar: مدير النظام

source: Quick Actions
ar: إجراءات سريعة

source: Add Member
ar: إضافة عضو

source: Book Session
ar: حجز جلسة

source: Previous
ar: السابق

source: Next
ar: التالي

source: Contact Information
ar: معلومات الاتصال

# NoHealthRecord
source: No health record available
ar: لا يوجد سجل صحي متاح

source: Date
ar: التاريخ

source: Notes
ar: ملاحظات

# NoAttendanceRecords
source: No attendance records found for this member.
ar: لا توجد سجلات حضور لهذا العضو.

# DeleteMemberConfirmation
source: Are you sure you want to delete this member?
ar: هل أنت متأكد من حذف هذا العضو؟

# DeleteMemberDesc
source: This action cannot be undone. All member data will be permanently deleted.
ar: هذا الإجراء لا يمكن التراجع عنه. سيتم حذف جميع بيانات العضو بشكل دائم.

source: Training Sessions
ar: جلسات التدريب

# SessionDesc
source: Schedule and oversee group training activities.
ar: جدولة ومراقبة أنشطة التدريب الجماعية.

source: Schedule New Session
ar: جدولة جلسة جديدة

source: Upcoming
ar: قادمة

source: Live
ar: مباشر

source: slots left
ar: أماكن شاغرة

source: Delete Session
ar: حذف الجلسة

source: No sessions scheduled
ar: لا توجد جلسات مجدولة

# NoSessionsDesc
source: There are no training sessions matching your current filter.
ar: لا توجد جلسات تدريب تطابق البحث الحالي.

source: Schedule Session
ar: جدولة الجلسة

source: New Schedule
ar: جدول جديد

source: Class Category
ar: فئة الصف

source: Select Category
ar: اختر الفئة

source: Lead Trainer
ar: المدرب الرئيسي

source: Select Trainer
ar: اختر المدرب

source: Session Description
ar: وصف الجلسة

source: Max Capacity
ar: السعة القصوى

# CapacityNote
source: Most classes perform best with 15-25 members.
ar: تعمل معظم الفصول بشكل أفضل مع 15-25 عضوًا.

source: Date & Time Schedule
ar: جدول التاريخ والوقت

source: Starts At
ar: تبدأ في

source: Ends At
ar: تنتهي في

# TimezoneNote
source: Times are in system local timezone (UTC+02:00).
ar: الأوقات بالتوقيت المحلي للنظام (UTC+02:00).

source: Session Details
ar: تفاصيل الجلسة

source: Reschedule
ar: إعادة جدولة

source: Back to Schedule
ar: العودة إلى الجدول

# AboutSession
source: About this Session
ar: حول هذه الجلسة

source: Participation
ar: مشاركة

source: Confirmed Bookings
ar: الحجوزات المؤكدة

source: Location
ar: الموقع

source: Main Gym Hall
ar: الصالة الرياضية الرئيسية

source: Default
ar: افتراضي

source: Schedule Timeline
ar: الجدول الزمني

source: Start
ar: بدء

source: End
ar: نهاية

# SessionInProgress
source: Session Currently In Progress
ar: الجلسة قيد التقدم حالياً

source: elapsed
ar: منقضي

source: remaining
ar: متبقي

source: Session ID
ar: معرف الجلسة

# SystemProfile
source: System generated profile
ar: مل تم إنشاؤه بواسطة النظام

source: Update Session
ar: تحديث الجلسة

source: Edit Schedule
ar: تعديل الجدول

source: Session Information
ar: معلومات الجلسة

# SessionInfoDesc
source: Category and basic structure cannot be changed once session is created and bookings might exist.
ar: لا يمكن تغيير الفئة والهيكل الأساسي بمجرد إنشاء الجلسة وقد يكون هناك حجوزات موجودة.

source: Assigned Lead Trainer
ar: المدرب الرئيسي المعين

source: Update Description
ar: تحديث الوصف

source: Update Time Slots
ar: تحديث الفترات الزمنية

source: Start Time
ar: وقت البدء

source: End Time
ar: وقت الانتهاء

# ScheduleChangeWarning
source: Changing schedule might affect members who already booked this session.
ar: قد يؤثر تغيير الجدول على الأعضاء الذين حجزوا هذه الجلسة بالفعل.

# DeleteSessionConfirmation
source: Are you sure you want to delete this session?
ar: هل أنت متأكد من حذف هذه الجلسة؟

source: Expiring Memberships
ar: الاشتراكات المنتهية قريباً

source: Expiring Soon
ar: تنتهي قريباً

# ShowingPlansExpiringWithin
source: Showing plans expiring within the next
ar: عرض الاشتراكات التي تنتهي خلال

source: Days
ar: أيام

source: Send Reminders
ar: إرسال تنبيهات

# DaysShort
source: Day(s)
ar: يوم

source: Expiration Date
ar: تاريخ الانتهاء

source: Time Left
ar: الوقت المتبقي

source: Days Left
ar: يوم متبقي

source: View Profile
ar: عرض الملف الشخصي

# NoExpiringMembershipsTitle
source: No Expiring Memberships
ar: لا توجد اشتراكات تنتهي قريباً

# NoExpiringMembershipsDesc
source: All current memberships are stable for the requested timeframe.
ar: جميع الاشتراكات النشطة مستقرة خلال الفترة المحددة.

# BackToActive
source: Back to Active Memberships
ar: العودة للاشتراكات النشطة

source: How it works?
ar: كي يعمل هذا؟

# ExpiringSoonInfo
source: This page lists members whose subscriptions are ending soon. You can send automated email reminders using the button above.
ar: تعرض هذه الصحفة الأعضاء الذين تنتهي اشتراكاتهم قريباً. يمكنك إرسال تنبيهات عبر البريد الإلكتروني باستخدام الزر أعلاه.

# DeleteSessionDesc
source: This action cannot be undone. All session data and bookings will be permanently deleted.
ar: هذا الإجراء لا يمكن التراجع عنه. سيتم حذف جميع بيانات الجلسة والحجوزات بشكل دائم.

source: Active Memberships
ar: العضويات النشطة

# MembershipsDesc
source: Track and manage gym subscription plans.
ar: تتبع وإدارة خطط اشتراك النادي الرياضي.

source: Export Excel
ar: تصدير إكسل

source: New Membership
ar: عضوية جديدة

source: Starts
ar: يبدأ

source: Ends
ar: ينتهي

source: Watch
ar: متابعة

source: Frozen
ar: مجمد

source: Unfreeze
ar: إلغاء التجميد

source: Freeze
ar: تجميد

# NoMembershipsFound
source: No active memberships found
ar: لم يتم العثور على عضويات نشطة

# NoMembershipsDesc
source: Currently there are no active gymnast subscriptions.
ar: لا توجد اشتراكات أعضاء نشطة حالياً.

source: Activate First Plan
ar: تفعيل أول باقة

source: Freeze Membership
ar: تجميد العضوية

# FreezeWarningPart1
source: You are about to freeze
ar: أنت على وشك تجميد عضوية

source: Freeze Duration (Days)
ar: مدة التجميد (بالأيام)
